StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <register>
                    <name>SEP0_STS</name>
                    <description>USB_SEP Status Register</description>
                    <addressOffset>0x00000104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>SCCRCERR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCBSERR</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCRXOF</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCRXTO</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCNAKSENT</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCSTALLSENT</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCACKRXED</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCDATASEQ</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEP0_TS</name>
                    <addressOffset>0x00000108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>SCTTYPE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEP0_NTS</name>
                    <addressOffset>0x0000010C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>NTTYPE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="SEP0_CTRL">
                    <name>SEP1_CTRL</name>
                    <addressOffset>0x00000110</addressOffset>
                </register>
                <register derivedFrom="SEP0_STS">
                    <name>SEP1_STS</name>
                    <addressOffset>0x00000114</addressOffset>
                </register>
                <register derivedFrom="SEP0_TS">
                    <name>SEP1_TS</name>
                    <addressOffset>0x00000118</addressOffset>
                </register>
                <register derivedFrom="SEP0_NTS">
                    <name>SEP1_NTS</name>
                    <addressOffset>0x0000011C</addressOffset>
                </register>
                <register derivedFrom="SEP0_CTRL">
                    <name>SEP2_CTRL</name>
                    <addressOffset>0x00000120</addressOffset>
                </register>
                <register derivedFrom="SEP0_STS">
                    <name>SEP2_STS</name>
                    <addressOffset>0x00000124</addressOffset>
                </register>
                <register derivedFrom="SEP0_TS">
                    <name>SEP2_TS</name>
                    <addressOffset>0x00000128</addressOffset>
                </register>
                <register derivedFrom="SEP0_NTS">
                    <name>SEP2_NTS</name>
                    <addressOffset>0x0000012C</addressOffset>
                </register>
                <register derivedFrom="SEP0_CTRL">
                    <name>SEP3_CTRL</name>
                    <addressOffset>0x00000130</addressOffset>
                </register>
                <register derivedFrom="SEP0_STS">
                    <name>SEP3_STS</name>
                    <addressOffset>0x00000134</addressOffset>
                </register>
                <register derivedFrom="SEP0_TS">
                    <name>SEP3_TS</name>
                    <addressOffset>0x00000138</addressOffset>
                </register>
