StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
            </registers>
        </peripheral>
        <!--FT_CNTR-->
        <peripheral>
            <name>FT_CNTR</name>
            <version>1.0</version>
            <description>Fault Tolerance Control</description>
            <groupName>FT_CNTR</groupName>
            <baseAddress>0x40003000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x88</size>
                <usage>registers</usage>
            </addressBlock>
            <!--FT_IF0-->
            <interrupt>
                <name>FT_IF0</name>
                <value>32</value>
            </interrupt>
            <!--FT_IF1-->
            <interrupt>
                <name>FT_IF1</name>
                <value>33</value>
            </interrupt>
            <!--FT_IF2-->
            <interrupt>
                <name>FT_IF2</name>
                <value>34</value>
            </interrupt>
            <!--FT_IF3-->
            <interrupt>
                <name>FT_IF3</name>
                <value>35</value>
            </interrupt>
            <registers>
                <!--KEY-->
                <register>
                    <name>KEY</name>
                    <description>Key lock Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!--CONTROL-->
                <register>
                    <name>CONTROL</name>
                    <description>CONTROL Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0x00000006</resetMask>
                    <fields>
                        <field>
                            <name>TICKOVER_IE</name>
                            <description>Enable IQR on TICKOVER</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESET_TIMEOUT_CNT</name>
                            <description>Reset register TIMEOUTCNT</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--STATUS-->
                <register>
                    <name>STATUS</name>
                    <description>Status Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000007F</resetMask>
                    <fields>
                        <field>
                            <name>TICKOVER</name>
                            <description>TICKOVER</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIRST_EVENT</name>
                            <description>FIRST_EVENT</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LAST_EVENT</name>
                            <description>LAST_EVENT</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FT_IF0</name>
                            <description>FT_IF0</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FT_IF1</name>
                            <description>FT_IF1</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FT_IF2</name>
                            <description>FT_IF2</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FT_IF3</name>
                            <description>FT_IF3</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--TIMEOUT-->
                <register>
                    <name>TIMEOUT</name>
                    <description>TIMEOUT Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>TIMEOUT</name>
                            <description>TIMEOUT</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--TICKCNT-->
                <register>
                    <name>TICKCNT</name>
                    <description>TICKCNT Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TICKCNT</name>
                            <description>TICKCNT</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
