StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--FIRSTEVENT-->
                <register>
                    <name>FIRSTEVENT</name>
                    <description>FIRSTEVENT Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FIRSTEVENT</name>
                            <description>FIRSTEVENT</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LASTEVENT-->
                <register>
                    <name>LASTEVENT</name>
                    <description>LASTEVENT Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LASTEVENT</name>
                            <description>LASTEVENT</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--TIMEOUTCNT-->
                <register>
                    <name>TIMEOUTCNT</name>
                    <description>TIMEOUTCNT Register</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0001FFFF</resetValue>
                    <resetMask>0x0001FFFF</resetMask>
                    <fields>
                        <field>
                            <name>TIMEOUTCNT</name>
                            <description>TIMEOUTCNT</description>
                            <bitRange>[16:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--EVENT0-->
                <register>
                    <name>EVENT0_HIGH</name>
                    <description>EVENT0 (HIGH) Register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003FFF</resetMask>
                    <fields>
                        <field>
                            <name>COMP_REG_ERR</name>
                            <description>COMP_REG_ERR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_I_COMP_ERR</name>
                            <description>AHB_I_COMP_ERR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_D_COMP_ERR</name>
                            <description>AHB_D_COMP_ERR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_S_COMP_ERR</name>
                            <description>AHB_S_COMP_ERR</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_M_COMP_ERR</name>
                            <description>AHB_M_COMP_ERR</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_C_COMP_ERR</name>
                            <description>AHB_C_COMP_ERR</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_OTP_COMP_ERR</name>
                            <description>AHB_OTP_COMP_ERR</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTP_COMP_REG_ERR</name>
                            <description>OTP_COMP_REG_ERR</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_RAMD_COMP_ERR</name>
                            <description>AHB_RAMD_COMP_ERR</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMD_COMP_REG_ERR</name>
                            <description>RAMD_COMP_REG_ERR</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_EXTBUS_COMP_ERR</name>
                            <description>AHB_EXTBUS_COMP_ERR</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTBUS_COMP_REG_ERR</name>
                            <description>EXTBUS_COMP_REG_ERR</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--EVENT1-->
                <register>
                    <name>EVENT1_HIGH</name>
                    <description>EVENT1 (HIGH) Register</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ECCERRI_0</name>
                            <description>ECCERRI_0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRD_0</name>
                            <description>ECCERRD_0</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRS_0</name>
                            <description>ECCERRS_0</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRM_0</name>
                            <description>ECCERRM_0</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRC_0</name>
                            <description>ECCERRC_0</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRI_1</name>
                            <description>ECCERRI_1</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRD_1</name>
                            <description>ECCERRD_1</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRS_1</name>
                            <description>ECCERRS_1</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRM_1</name>
                            <description>ECCERRM_1</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRC_1</name>
                            <description>ECCERRC_1</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_ROM</name>
                            <description>ECCERR_ROM</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_OTP0</name>
                            <description>ECCERR_OTP0</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_OTP1</name>
                            <description>ECCERR_OTP1</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_RAMD0</name>
                            <description>ECCERR_RAMD0</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_RAMD1</name>
                            <description>ECCERR_RAMD1</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_EXTBUS0</name>
                            <description>ECCERR_EXTBUS0</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_EXTBUS1</name>
                            <description>ECCERR_EXTBUS1</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
