StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--EVENT10-->
                <register>
                    <name>EVENT10_LOW</name>
                    <description>EVENT10 (LOW) Register</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003F</resetMask>
                    <fields>
                        <field>
                            <name>PORTA_CURLIM</name>
                            <description>PORTA_CURLIM</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTB_CURLIM</name>
                            <description>PORTB_CURLIM</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTC_CURLIM</name>
                            <description>PORTC_CURLIM</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTD_CURLIM</name>
                            <description>PORTD_CURLIM</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTE_CURLIM</name>
                            <description>PORTE_CURLIM</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTF_CURLIM</name>
                            <description>PORTF_CURLIM</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--EVENT11-->
                <register>
                    <name>EVENT11_LOW</name>
                    <description>EVENT11 (LOW) Register</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007FFF</resetMask>
                    <fields>
                        <field>
                            <name>CAN0_DE</name>
                            <description>CAN0_DE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIL0_DE</name>
                            <description>MIL0_DE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIL1_DE</name>
                            <description>MIL1_DE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARC0_DE</name>
                            <description>ARC0_DE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARC1_DE</name>
                            <description>ARC1_DE</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMAC0_DE</name>
                            <description>EMAC0_DE</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--EVENT12-->
                <register>
                    <name>EVENT12_LOW</name>
                    <description>EVENT12 (LOW) Register</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007FFF</resetMask>
                    <fields>
                        <field>
                            <name>CAN0_SE</name>
                            <description>CAN0_SE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIL0_SE</name>
                            <description>MIL0_SE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIL1_SE</name>
                            <description>MIL1_SE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARC0_SE</name>
                            <description>ARC0_SE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARC1_SE</name>
                            <description>ARC1_SE</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMAC0_SE</name>
                            <description>EMAC0_SE</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RESET_EVENT0-->
                <register>
                    <name>RESET_EVENT0_HIGH</name>
                    <description>RESET_EVENT0 (HIGH) Register</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00003FFF</resetValue>
                    <resetMask>0x00003FFF</resetMask>
                    <fields>
                        <field>
                            <name>COMP_REG_ERR</name>
                            <description>COMP_REG_ERR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_I_COMP_ERR</name>
                            <description>AHB_I_COMP_ERR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_D_COMP_ERR</name>
                            <description>AHB_D_COMP_ERR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_S_COMP_ERR</name>
                            <description>AHB_S_COMP_ERR</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_M_COMP_ERR</name>
                            <description>AHB_M_COMP_ERR</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_C_COMP_ERR</name>
                            <description>AHB_C_COMP_ERR</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_OTP_COMP_ERR</name>
                            <description>AHB_OTP_COMP_ERR</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTP_COMP_REG_ERR</name>
                            <description>OTP_COMP_REG_ERR</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_RAMD_COMP_ERR</name>
                            <description>AHB_RAMD_COMP_ERR</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMD_COMP_REG_ERR</name>
                            <description>RAMD_COMP_REG_ERR</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHB_EXTBUS_COMP_ERR</name>
                            <description>AHB_EXTBUS_COMP_ERR</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTBUS_COMP_REG_ERR</name>
                            <description>EXTBUS_COMP_REG_ERR</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RESET_EVENT1-->
                <register>
                    <name>RESET_EVENT1_HIGH</name>
                    <description>RESET_EVENT1 (HIGH) Register</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000FFFFF</resetValue>
                    <resetMask>0x000FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ECCERRI_0</name>
                            <description>ECCERRI_0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRD_0</name>
                            <description>ECCERRD_0</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRS_0</name>
                            <description>ECCERRS_0</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRM_0</name>
                            <description>ECCERRM_0</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRC_0</name>
                            <description>ECCERRC_0</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRI_1</name>
                            <description>ECCERRI_1</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRD_1</name>
                            <description>ECCERRD_1</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRS_1</name>
                            <description>ECCERRS_1</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRM_1</name>
                            <description>ECCERRM_1</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERRC_1</name>
                            <description>ECCERRC_1</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_ROM</name>
                            <description>ECCERR_ROM</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_OTP0</name>
                            <description>ECCERR_OTP0</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_OTP1</name>
                            <description>ECCERR_OTP1</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_RAMD0</name>
                            <description>ECCERR_RAMD0</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_RAMD1</name>
                            <description>ECCERR_RAMD1</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_EXTBUS0</name>
                            <description>ECCERR_EXTBUS0</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERR_EXTBUS1</name>
                            <description>ECCERR_EXTBUS1</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RESET_EVENT2-->
                <register>
                    <name>RESET_EVENT2_HIGH</name>
                    <description>RESET_EVENT2 (HIGH) Register</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000003FF</resetValue>
                    <resetMask>0x000003FF</resetMask>
                    <fields>
                        <field>
                            <name>ECC_ROM_DE</name>
                            <description>ECC_ROM_DE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_OTP_DE</name>
                            <description>ECC_OTP_DE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_RAMD_DE</name>
                            <description>ECC_RAMD_DE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_EXTBUS_DE</name>
                            <description>ECC_EXTBUS_DE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_CACHE_I_0_DE</name>
                            <description>ECC_CACHE_I_0_DE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_CACHE_I_1_DE</name>
                            <description>ECC_CACHE_I_1_DE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_CACHE_D_0_DE</name>
                            <description>ECC_CACHE_D_0_DE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_CACHE_D_1_DE</name>
                            <description>ECC_CACHE_D_1_DE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_CACHE_RAMD_DE</name>
                            <description>ECC_CACHE_RAMD_DE</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
