StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--RESET_EVENT3-->
                <register>
                    <name>RESET_EVENT3_HIGH</name>
                    <description>RESET_EVENT3 (HIGH) Register</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000000F</resetValue>
                    <resetMask>0x0000000F</resetMask>
                    <fields>
                        <field>
                            <name>CLK_MONITOR0</name>
                            <description>CLK_MONITOR0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_MONITOR1</name>
                            <description>CLK_MONITOR1</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_MONITOR2</name>
                            <description>CLK_MONITOR2</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_MONITOR3</name>
                            <description>CLK_MONITOR3</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RESET_EVENT4-->
                <register>
                    <name>RESET_EVENT4_HIGH</name>
                    <description>RESET_EVENT4 (HIGH) Register</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000001FF</resetValue>
                    <resetMask>0x000001FF</resetMask>
                    <fields>
                        <field>
                            <name>RTC_ERR</name>
                            <description>RTC_ERR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKP_ERR</name>
                            <description>BKP_ERR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKP_MEM_DE</name>
                            <description>BKP_MEM_DE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FTCNTR_ERR</name>
                            <description>FTCNTR_ERR</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FT_REG_DE</name>
                            <description>FT_REG_DE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTP_REG_DE</name>
                            <description>OTP_REG_DE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMD_REG_DE</name>
                            <description>RAMD_REG_DE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ROM_REG_DE</name>
                            <description>ROM_REG_DE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--IE_EVENT5-->
                <register>
                    <name>IE_EVENT5_FT_IF2</name>
                    <description>IE_EVENT5 (FT_IF2) Register</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x1FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY_DE</name>
                            <description>KEY_DE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MAX_CLK_DE</name>
                            <description>MAX_CLK_DE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPU_CLK_DE</name>
                            <description>CPU_CLK_DE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PER_CLK_DE</name>
                            <description>PER_CLK_DE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSI_CLK_DE</name>
                            <description>LSI_CLK_DE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSE_CLK_DE</name>
                            <description>LSE_CLK_DE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSE0_CLK_DE</name>
                            <description>HSE0_CLK_DE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSE1_CLK_DE</name>
                            <description>HSE1_CLK_DE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0_CLK_DE</name>
                            <description>PLL0_CLK_DE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1_CLK_DE</name>
                            <description>PLL1_CLK_DE</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2_CLK_DE</name>
                            <description>PLL2_CLK_DE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN_CLK_DE</name>
                            <description>CAN_CLK_DE</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM_CLK_DE</name>
                            <description>TIM_CLK_DE</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIL_CLK_DE</name>
                            <description>MIL_CLK_DE</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPHY_CLK_DE</name>
                            <description>EPHY_CLK_DE</description>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPW_CLK_DE</name>
                            <description>SPW_CLK_DE</description>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART_CLK_DE</name>
                            <description>UART_CLK_DE</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSP_CLK_DE</name>
                            <description>SSP_CLK_DE</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC_CLK_DE</name>
                            <description>ADC_CLK_DE</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAC_CLK_DE</name>
                            <description>DAC_CLK_DE</description>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_CLK_DE</name>
                            <description>RTC_CLK_DE</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--IE_EVENT6-->
                <register>
                    <name>IE_EVENT6_FT_IF2</name>
                    <description>IE_EVENT6 (FT_IF2) Register</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>CPU_CLOCK_ERROR</name>
                            <description>CPU_CLOCK_ERROR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSE0_CLOCK_ERROR</name>
                            <description>HSE0_CLOCK_ERROR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSE1_CLOCK_ERROR</name>
                            <description>HSE1_CLOCK_ERROR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSI_CLOCK_ERROR</name>
                            <description>LSI_CLOCK_ERROR</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSE_CLOCK_ERROR</name>
                            <description>LSE_CLOCK_ERROR</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0_CLOCK_ERROR</name>
                            <description>PLL0_CLOCK_ERROR</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1_CLOCK_ERROR</name>
                            <description>PLL1_CLOCK_ERROR</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2_CLOCK_ERROR</name>
                            <description>PLL2_CLOCK_ERROR</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--IE_EVENT7-->
                <register>
                    <name>IE_EVENT7_FT_IF2</name>
                    <description>IE_EVENT7 (FT_IF2) Register</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007FFF</resetMask>
                    <fields>
                        <field>
                            <name>OTP_SE</name>
                            <description>OTP_SE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ROM_SE</name>
                            <description>ROM_SE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_CACHE_I_0_SE</name>
                            <description>ECC_CACHE_I_0_SE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_CACHE_I_1_SE</name>
                            <description>ECC_CACHE_I_1_SE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_CACHE_D_0_SE</name>
                            <description>ECC_CACHE_D_0_SE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC_CACHE_D_1_SE</name>
                            <description>ECC_CACHE_D_1_SE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMD_SE</name>
                            <description>RAMD_SE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKP_MEM_SE</name>
                            <description>BKP_MEM_SE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FT_REG_SE</name>
                            <description>FT_REG_SE</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTP_REG_SE</name>
                            <description>OTP_REG_SE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMD_REG_SE</name>
                            <description>RAMD_REG_SE</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ROM_REG_SE</name>
                            <description>ROM_REG_SE</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMD_CACHE_SE</name>
                            <description>RAMD_CACHE_SE</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
