StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--IE_EVENT8-->
                <register>
                    <name>IE_EVENT8_FT_IF2</name>
                    <description>IE_EVENT8 (FT_IF2) Register</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007FF</resetMask>
                    <fields>
                        <field>
                            <name>PVD_UCC_EVENT</name>
                            <description>PVD_UCC_EVENT</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD_UCC1_EVENT</name>
                            <description>PVD_UCC1_EVENT</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD_BUCC_EVENT</name>
                            <description>PVD_BUCC_EVENT</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LDO0_CUR_EVENT</name>
                            <description>LDO0_CUR_EVENT</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LDO1_CUR_EVENT</name>
                            <description>LDO1_CUR_EVENT</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LDO2_CUR_EVENT</name>
                            <description>LDO2_CUR_EVENT</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LDO3_CUR_EVENT</name>
                            <description>LDO3_CUR_EVENT</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LDO4_CUR_EVENT</name>
                            <description>LDO4_CUR_EVENT</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LDO5_CUR_EVENT</name>
                            <description>LDO5_CUR_EVENT</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LDO6_CUR_EVENT</name>
                            <description>LDO6_CUR_EVENT</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LDO7_CUR_EVENT</name>
                            <description>LDO7_CUR_EVENT</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--IE_EVENT9-->
                <register>
                    <name>IE_EVENT9_FT_IF3</name>
                    <description>IE_EVENT9 (FT_IF3) Register</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x1FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY_SE</name>
                            <description>KEY_SE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MAX_CLK_SE</name>
                            <description>MAX_CLK_SE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPU_CLK_SE</name>
                            <description>CPU_CLK_SE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PER_CLK_SE</name>
                            <description>PER_CLK_SE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSI_CLK_SE</name>
                            <description>LSI_CLK_SE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSE_CLK_SE</name>
                            <description>LSE_CLK_SE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSE0_CLK_SE</name>
                            <description>HSE0_CLK_SE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSE1_CLK_SE</name>
                            <description>HSE1_CLK_SE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0_CLK_SE</name>
                            <description>PLL0_CLK_SE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1_CLK_SE</name>
                            <description>PLL1_CLK_SE</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2_CLK_SE</name>
                            <description>PLL2_CLK_SE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN_CLK_SE</name>
                            <description>CAN_CLK_SE</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM_CLK_SE</name>
                            <description>TIM_CLK_SE</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARC_CLK_SE</name>
                            <description>ARC_CLK_SE</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMAC_CLK_SE</name>
                            <description>EMAC_CLK_SE</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPHY_CLK_SE</name>
                            <description>EPHY_CLK_SE</description>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPW_CLK_SE</name>
                            <description>SPW_CLK_SE</description>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART_CLK_SE</name>
                            <description>UART_CLK_SE</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSP_CLK_SE</name>
                            <description>SSP_CLK_SE</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC_CLK_SE</name>
                            <description>ADC_CLK_SE</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAC_CLK_SE</name>
                            <description>DAC_CLK_SE</description>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_CLK_SE</name>
                            <description>RTC_CLK_SE</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--IE_EVENT10-->
                <register>
                    <name>IE_EVENT10_FT_IF3</name>
                    <description>IE_EVENT10 (FT_IF3) Register</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003F</resetMask>
                    <fields>
                        <field>
                            <name>PORTA_CURLIM</name>
                            <description>PORTA_CURLIM</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTB_CURLIM</name>
                            <description>PORTB_CURLIM</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTC_CURLIM</name>
                            <description>PORTC_CURLIM</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTD_CURLIM</name>
                            <description>PORTD_CURLIM</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTE_CURLIM</name>
                            <description>PORTE_CURLIM</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTF_CURLIM</name>
                            <description>PORTF_CURLIM</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--IE_EVENT11-->
                <register>
                    <name>IE_EVENT11_FT_IF3</name>
                    <description>IE_EVENT11 (FT_IF3) Register</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007FFF</resetMask>
                    <fields>
                        <field>
                            <name>CAN0_DE</name>
                            <description>CAN0_DE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIL0_DE</name>
                            <description>MIL0_DE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIL1_DE</name>
                            <description>MIL1_DE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARC0_DE</name>
                            <description>ARC0_DE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARC1_DE</name>
                            <description>ARC1_DE</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMAC0_DE</name>
                            <description>EMAC0_DE</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
