StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--IE_EVENT12-->
                <register>
                    <name>IE_EVENT12_FT_IF3</name>
                    <description>IE_EVENT12 (FT_IF3) Register</description>
                    <addressOffset>0x00000084</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007FFF</resetMask>
                    <fields>
                        <field>
                            <name>CAN0_SE</name>
                            <description>CAN0_SE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIL0_SE</name>
                            <description>MIL0_SE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIL1_SE</name>
                            <description>MIL1_SE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARC0_SE</name>
                            <description>ARC0_SE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARC1_SE</name>
                            <description>ARC1_SE</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMAC0_SE</name>
                            <description>EMAC0_SE</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--MDR_WDT-->
        <peripheral>
            <name>MDR_WDT</name>
            <version>1.0</version>
            <description>Watch Dog Timer</description>
            <groupName>WDT</groupName>
            <baseAddress>0x40004000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x10</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--KEY-->
                <register>
                    <name>KEY</name>
                    <description>Key lock Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!--PRL-->
                <register>
                    <name>PRL</name>
                    <description>PRL Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PRL</name>
                            <description>PRL</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--EN-->
                <register>
                    <name>EN</name>
                    <description>EN Register: Counter run - 0x03333</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CNT-->
                <register>
                    <name>CNT</name>
                    <description>CNT Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>CNT</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--MDR_EBC-->
        <peripheral>
            <name>MDR_EBC</name>
            <version>1.0</version>
            <description>External Bus Control</description>
            <groupName>EBC</groupName>
            <baseAddress>0x40005000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x88</size>
                <usage>registers</usage>
            </addressBlock>
            <!--EXT_INTERROR0-->
            <interrupt>
                <name>EXT_INTERROR0</name>
                <value>40</value>
            </interrupt>
            <!--EXT_INTERROR1-->
            <interrupt>
                <name>EXT_INTERROR1</name>
                <value>41</value>
            </interrupt>
            <!--EXT_INTERROR2-->
            <interrupt>
                <name>EXT_INTERROR2</name>
                <value>42</value>
            </interrupt>
            <!--EXT_INTERROR3-->
            <interrupt>
                <name>EXT_INTERROR3</name>
                <value>43</value>
            </interrupt>
            <!--EXT_INTERROR4-->
            <interrupt>
                <name>EXT_INTERROR4</name>
                <value>44</value>
            </interrupt>
            <!--EXT_INTERROR5-->
            <interrupt>
                <name>EXT_INTERROR5</name>
                <value>45</value>
            </interrupt>
            <!--EXT_INTERROR6-->
            <interrupt>
                <name>EXT_INTERROR6</name>
                <value>46</value>
            </interrupt>
            <!--EXT_INTERROR7-->
            <interrupt>
                <name>EXT_INTERROR7</name>
                <value>47</value>
            </interrupt>
            <registers>
                <!--KEY-->
                <register>
                    <name>KEY</name>
                    <description>Key lock Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!--REGION[0].CNTRL-->
                <register>
                    <name>REGION0_CNTRL</name>
                    <description>REGION[0].CNTRL Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>0 - Region OFF, 1 - Region ON</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCEN</name>
                            <description>0 - ECC OFF, 1 - ECC ON</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCMODE</name>
                            <description>0 - parallel ECC, 1 - serial ECC</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDYWAIT</name>
                            <description>RDYWAIT</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>MODE[1:0]: 00 - 32, 01 - 16, 10 - 8, 11 - 64</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ROM</name>
                            <description>0 - RAM, 1 - ROM</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPOL</name>
                            <description>Clock in Active: 0 - Rise, 1 - Fall</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WS_ACTIVE</name>
                            <description>T = HCLK*(WS_ACTIVE+1)</description>
                            <bitRange>[15:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WS_SETUP</name>
                            <description>T = HCLK*(WS_SETUP+1)</description>
                            <bitRange>[19:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WS_HOLD</name>
                            <description>T = HCLK*(WS_HOLD+1)</description>
                            <bitRange>[23:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CACHEBLE</name>
                            <description>0 - CACHEBLE OFF, 1 - CACHEBLE ON</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>READ32</name>
                            <description>READ32 Register</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENOCLK</name>
                            <description>0 - OCL OFF, 1 - OCL ON</description>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIVOCLK</name>
                            <description>DIVOCLK Register</description>
                            <bitRange>[31:28]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
