StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--REGION[3].ECCCS-->
                <register>
                    <name>REGION3_ECCCS</name>
                    <description>REGION[3].ECCCS Register</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SECC</name>
                            <description>SECC</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DECC</name>
                            <description>DECC</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SECC_IE</name>
                            <description>SECC_IE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DECC_IE</name>
                            <description>DECC_IE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIX_SECC</name>
                            <description>FIX_SECC</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIX_DECC</name>
                            <description>FIX_DECC</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR_SCNT</name>
                            <description>CLR_SCNT</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR_DCNT</name>
                            <description>CLR_DCNT</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEEC_CNT</name>
                            <description>DEEC_CNT</description>
                            <bitRange>[15:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEEC_CNT</name>
                            <description>SEEC_CNT</description>
                            <bitRange>[31:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--REGION[4].CNTRL-->
                <register>
                    <name>REGION4_CNTRL</name>
                    <description>REGION[4].CNTRL Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>0 - Region OFF, 1 - Region ON</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCEN</name>
                            <description>0 - ECC OFF, 1 - ECC ON</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCMODE</name>
                            <description>0 - parallel ECC, 1 - serial ECC</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDYWAIT</name>
                            <description>RDYWAIT</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>MODE[1:0]: 00 - 32, 01 - 16, 10 - 8, 11 - 64</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ROM</name>
                            <description>0 - RAM, 1 - ROM</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPOL</name>
                            <description>Clock in Active: 0 - Rise, 1 - Fall</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WS_ACTIVE</name>
                            <description>T = HCLK*(WS_ACTIVE+1)</description>
                            <bitRange>[15:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WS_SETUP</name>
                            <description>T = HCLK*(WS_SETUP+1)</description>
                            <bitRange>[19:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WS_HOLD</name>
                            <description>T = HCLK*(WS_HOLD+1)</description>
                            <bitRange>[23:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CACHEBLE</name>
                            <description>0 - CACHEBLE OFF, 1 - CACHEBLE ON</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>READ32</name>
                            <description>READ32 Register</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENOCLK</name>
                            <description>0 - OCL OFF, 1 - OCL ON</description>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--REGION[4].ECCBASE-->
                <register>
                    <name>REGION4_ECCBASE</name>
                    <description>REGION[4].ECCBASE Register</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ECCBASE</name>
                            <description>ECCBASE</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--REGION[4].ECCCS-->
                <register>
                    <name>REGION4_ECCCS</name>
                    <description>REGION[4].ECCCS Register</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SECC</name>
                            <description>SECC</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DECC</name>
                            <description>DECC</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SECC_IE</name>
                            <description>SECC_IE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DECC_IE</name>
                            <description>DECC_IE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIX_SECC</name>
                            <description>FIX_SECC</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIX_DECC</name>
                            <description>FIX_DECC</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR_SCNT</name>
                            <description>CLR_SCNT</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR_DCNT</name>
                            <description>CLR_DCNT</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEEC_CNT</name>
                            <description>DEEC_CNT</description>
                            <bitRange>[15:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEEC_CNT</name>
                            <description>SEEC_CNT</description>
                            <bitRange>[31:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
