StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
            </registers>
        </peripheral>
        <!--MDR_OTP-->
        <peripheral>
            <name>MDR_OTP</name>
            <version>1.0</version>
            <description>OTP Memory Control</description>
            <groupName>OTPCNTR</groupName>
            <baseAddress>0x40006000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x28</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--KEY-->
                <register>
                    <name>KEY</name>
                    <description>Key lock Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!--CNTR-->
                <register>
                    <name>CNTR</name>
                    <description>CNTR Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WAITCYCL</name>
                            <description>WAITCYCL</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REG_ACCESS</name>
                            <description>REG_ACCESS</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SE_CLK</name>
                            <description>SE for OTP (1986VE8T), CLK for RAM (1986VE81T)</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>PE only for OTP (1986VE8T)</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OE</name>
                            <description>OE only for RAM (1986VE81T)</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WE0</name>
                            <description>WE only for RAM (1986VE81T)</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WE1</name>
                            <description>WE only for RAM (1986VE81T)</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WE2</name>
                            <description>WE only for RAM (1986VE81T)</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WE3</name>
                            <description>WE only for RAM (1986VE81T)</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WE4</name>
                            <description>WE only for RAM (1986VE81T)</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>CEN only for RAM (1986VE81T)</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WECC</name>
                            <description>WECC</description>
                            <bitRange>[23:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RECC</name>
                            <description>RECC</description>
                            <bitRange>[31:24]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ADR-->
                <register>
                    <name>ADR</name>
                    <description>ADR Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADR</name>
                            <description>ADR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--WDATA-->
                <register>
                    <name>WDATA</name>
                    <description>WDATA Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DATA</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RDATA-->
                <register>
                    <name>RDATA</name>
                    <description>RDATA Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DATA</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
