StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
            </registers>
        </peripheral>
        <!--MDR_RAMD-->
        <peripheral>
            <name>MDR_RAMD</name>
            <version>1.0</version>
            <description>RAMD Control</description>
            <groupName>RAMCNTR</groupName>
            <baseAddress>0x40008000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x18</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--KEY-->
                <register>
                    <name>KEY</name>
                    <description>Key lock Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!--ECCCS-->
                <register>
                    <name>ECCCS</name>
                    <description>ECCCS Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SECC</name>
                            <description>SECC</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DECC</name>
                            <description>DECC</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SECC_IE</name>
                            <description>SECC_IE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DECC_IE</name>
                            <description>DECC_IE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIX_SECC</name>
                            <description>FIX_SECC</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIX_DECC</name>
                            <description>FIX_DECC</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR_SCNT</name>
                            <description>CLR_SCNT</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR_DCNT</name>
                            <description>CLR_DCNT</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEEC_CNT</name>
                            <description>DEEC_CNT</description>
                            <bitRange>[15:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEEC_CNT</name>
                            <description>SEEC_CNT</description>
                            <bitRange>[31:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ECCADR-->
                <register>
                    <name>ECCADR</name>
                    <description>ECCADR Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ECCADR</name>
                            <description>ECCADR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ECCDATA-->
                <register>
                    <name>ECCDATA</name>
                    <description>ECCDATA Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ECCDATA</name>
                            <description>ECCDATA</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ECCECC-->
                <register>
                    <name>ECCECC</name>
                    <description>ECCECC Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ECC</name>
                            <description>ECC</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--TEST_TUNING-->
                <register>
                    <name>TEST_TUNING</name>
                    <description>TEST_TUNING Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TUNE</name>
                            <description>TUNE</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
