StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
            </registers>
        </peripheral>
        <!--MDR_DCACHE-->
        <peripheral derivedFrom="MDR_ICACHE">
            <name>MDR_DCACHE</name>
            <description>D-BUS Cache Controller</description>
            <baseAddress>0xE0045000</baseAddress>
        </peripheral>
        <!--MDR_SCACHE-->
        <peripheral derivedFrom="MDR_ICACHE">
            <name>MDR_SCACHE</name>
            <description>S-BUS Cache Controller</description>
            <baseAddress>0x4000B000</baseAddress>
        </peripheral>
        <!--MDR_PORTA-->
        <peripheral>
            <name>MDR_PORTA</name>
            <version>1.0</version>
            <description>PORTA</description>
            <groupName>MDR_PORT</groupName>
            <baseAddress>0x40080000</baseAddress>
            <size>32</size>
            <addressBlock>
                <offset>0</offset>
                <size>0x8C</size>
                <usage>registers</usage>
            </addressBlock>
            <!--IRQ_PORTA-->
            <interrupt>
                <name>IRQ_PORTA</name>
                <value>83</value>
            </interrupt>
            <registers>
                <!--KEY-->
                <register>
                    <name>KEY</name>
                    <description>Key lock Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!--RXTX-->
                <register>
                    <name>RXTX</name>
                    <description>GPIO Pin Data Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Pin data value</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_DATA_</headerEnumName>
                                <enumeratedValue>
                                    <name>Low</name>
                                    <description>LOW Level Voltage</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>High</name>
                                    <description>HIGH Level Voltage</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--SRXTX-->
                <register>
                    <name>SRXTX</name>
                    <description>Set RXTX by MASK Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Set 1 to pin</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_SRXTX</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Set bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CRXTX-->
                <register>
                    <name>CRXTX</name>
                    <description>Clear RXTX by MASK Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Set 0 to pin</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_CRXTX</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Clear bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
