StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--OE-->
                <register>
                    <name>OE</name>
                    <description>Read SOE: 0 - Input, 1 - Output.</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Read register SOE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_DIR_OUT</headerEnumName>
                                <enumeratedValue>
                                    <name>IN</name>
                                    <description>Input pin</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUT</name>
                                    <description>Output pin</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--SOE-->
                <register>
                    <name>SOE</name>
                    <description>Set OE by MASK Register. When reading: 0 - Input, 1 - Output.</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Set pin as output</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_SDIR_OUT</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Set bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--COE-->
                <register>
                    <name>COE</name>
                    <description>Clear OE by MASK Register. When reading: 0 - Input, 1 - Output.</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Set pin as input</description>
                            <bitRange>[0:0]</bitRange>
                            <modifiedWriteValues>clear</modifiedWriteValues>
                            <readAction>clear</readAction>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_CDIR_OUT</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Clear bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--FUNC0-->
                <register>
                    <name>FUNC0</name>
                    <description>Read SFUNC0 Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>8</dim>
                            <dimIncrement>4</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
                            <name>Func_Pin_%s</name>
                            <description>Read SFUNC0 Register</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--FUNC1-->
                <register>
                    <name>FUNC1</name>
                    <description>Read SFUNC1 Register</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>8</dim>
                            <dimIncrement>4</dimIncrement>
                            <dimIndex>8,9,10,11,12,13,14,15</dimIndex>
                            <name>Func_Pin_%s</name>
                            <description>Read SFUNC1 Register</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--FUNC2-->
                <register>
                    <name>FUNC2</name>
                    <description>Read SFUNC2 Register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>8</dim>
                            <dimIncrement>4</dimIncrement>
                            <dimIndex>16,17,18,19,20,21,22,23</dimIndex>
                            <name>Func_Pin_%s</name>
                            <description>Read SFUNC2 Register</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--FUNC3-->
                <register>
                    <name>FUNC3</name>
                    <description>Read SFUNC3 Register</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>8</dim>
                            <dimIncrement>4</dimIncrement>
                            <dimIndex>24,25,26,27,28,29,30,31</dimIndex>
                            <name>Func_Pin_%s</name>
                            <description>Read SFUNC3 Register</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--SFUNC0-->
                <register>
                    <name>SFUNC0</name>
                    <description>Set FUNC by MASK Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFUNC0</name>
                            <description>Set bits of FUNC</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SFUNC1-->
                <register>
                    <name>SFUNC1</name>
                    <description>Set FUNC by MASK Register</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFUNC1</name>
                            <description>Set bits of FUNC</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
