StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--SFUNC2-->
                <register>
                    <name>SFUNC2</name>
                    <description>Set FUNC by MASK Register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFUNC2</name>
                            <description>Set bits of FUNC</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SFUNC3-->
                <register>
                    <name>SFUNC3</name>
                    <description>Set FUNC by MASK Register</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFUNC3</name>
                            <description>Set bits of FUNC</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CFUNC0-->
                <register>
                    <name>CFUNC0</name>
                    <description>Clear FUNC by MASK Register</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CFUNC0</name>
                            <description>Clear bits of FUNC</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CFUNC1-->
                <register>
                    <name>CFUNC1</name>
                    <description>Clear FUNC by MASK Register</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CFUNC1</name>
                            <description>Clear bits of FUNC</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CFUNC2-->
                <register>
                    <name>CFUNC2</name>
                    <description>Clear FUNC by MASK Register</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CFUNC2</name>
                            <description>Clear bits of FUNC</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CFUNC3-->
                <register>
                    <name>CFUNC3</name>
                    <description>Clear FUNC by MASK Register</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CFUNC3</name>
                            <description>Clear bits of FUNC</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ANALOG-->
                <register>
                    <name>ANALOG</name>
                    <description>Read SANALOG: 0 - Analog, 1 - Digital.</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Read register SANALOG: 0 - Analog, 1 - Digital.</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_ANALOG</headerEnumName>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Pin works with Analog signal</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Pin works with Digital signal</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--SANALOG-->
                <register>
                    <name>SANALOG</name>
                    <description>Set ANALOG by MASK Register.</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Enable Digital mode</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_SANALOG</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Set bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CANALOG-->
                <register>
                    <name>CANALOG</name>
                    <description>Clear ANALOG by MASK Register.</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Enable Analog mode</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_CANALOG</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Clear bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--PULLUP-->
                <register>
                    <name>PULLUP</name>
                    <description>Read SPULLUP Register</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Read register SPULLUP</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_PULLUP</headerEnumName>
                                <enumeratedValue>
                                    <name>Off</name>
                                    <description>No pull selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UP</name>
                                    <description>Pin pulled up to VDD</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--SPULLUP-->
                <register>
                    <name>SPULLUP</name>
                    <description>Set PULLUP by MASK Register.</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Set pullup</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_SPULLUP</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Set bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CPULLUP-->
                <register>
                    <name>CPULLUP</name>
                    <description>Clear PULLUP by MASK Register.</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Clear pullup</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_CPULLUP</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Clear bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--PULLDOWN-->
                <register>
                    <name>PULLDOWN</name>
                    <description>Read SPULLDOWN Register</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Read register SPULLDOWN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_PULLDOWN</headerEnumName>
                                <enumeratedValue>
                                    <name>Off</name>
                                    <description>No pull selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOWN</name>
                                    <description>Pin pulled down to GND</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
