StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--SPWR1-->
                <register>
                    <name>SPWR1</name>
                    <description>Set PWR by MASK Register</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SPWR1</name>
                            <description>Set bits of PWR1</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CPWR0-->
                <register>
                    <name>CPWR0</name>
                    <description>Clear PWR by MASK Register</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CPWR0</name>
                            <description>Clear bits of PWR0</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CPWR1-->
                <register>
                    <name>CPWR1</name>
                    <description>Clear PWR by MASK Register</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CPWR1</name>
                            <description>Clear bits of PWR1</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CL-->
                <register>
                    <name>CL</name>
                    <description>Read SCL Register</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Read register SCL</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_CL</headerEnumName>
                                <enumeratedValue>
                                    <name>Off</name>
                                    <description>Current control is disabled</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>On</name>
                                    <description>Current control is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--SCL-->
                <register>
                    <name>SCL</name>
                    <description>Set CL by MASK Register.</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Set CL</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_SCL</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Set bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CCL-->
                <register>
                    <name>CCL</name>
                    <description>Clear CL by MASK Register.</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Clear CL</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_CCL</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Clear bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
