StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--IE-->
                <register>
                    <name>IE</name>
                    <description>Read SIE Register</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Read register SIE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_IE</headerEnumName>
                                <enumeratedValue>
                                    <name>Off</name>
                                    <description>Interrupt disabled</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>On</name>
                                    <description>Interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--SIE-->
                <register>
                    <name>SIE</name>
                    <description>Set IE by MASK Register.</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Set IE</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_SIE</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Set bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CIE-->
                <register>
                    <name>CIE</name>
                    <description>Clear IE by MASK Register.</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Clear IE</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_CIE</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Clear bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--IT-->
                <register>
                    <name>IT</name>
                    <description>Read SIT Register</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Read register SIT</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_IT</headerEnumName>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>Fix low level</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>Fix high level</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
