StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
                <!--SIT-->
                <register>
                    <name>SIT</name>
                    <description>Set IT by MASK Register.</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Set IT</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_SIT</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Set bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CIT-->
                <register>
                    <name>CIT</name>
                    <description>Clear IT by MASK Register.</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Clear IT</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_CIT</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Clear bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--IR-->
                <register>
                    <name>IR</name>
                    <description>Read SIR Register</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Read register SIR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_IR</headerEnumName>
                                <enumeratedValue>
                                    <name>Off</name>
                                    <description>Interrupt request is inactive</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>On</name>
                                    <description> Interrupt request is active</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--SIR-->
                <register>
                    <name>SIR</name>
                    <description>Set IR by MASK Register.</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Set IR</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_SIR</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Set bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CIR-->
                <register>
                    <name>CIR</name>
                    <description>Clear IR by MASK Register.</description>
                    <addressOffset>0x00000084</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Clear IR</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_CIR</headerEnumName>
                                <enumeratedValue>
                                    <name>Inactive</name>
                                    <description>Do nothing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Selected</name>
                                    <description>Clear bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--HCUR-->
                <register>
                    <name>HCUR</name>
                    <description>HCUR Register</description>
                    <addressOffset>0x00000088</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                            <name>Pin_%s</name>
                            <description>Register HCUR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <headerEnumName>MDR_GPIO__PIN_HCUR</headerEnumName>
                                <enumeratedValue>
                                    <name>Off</name>
                                    <description>Overcurrent is inactive</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>On</name>
                                    <description>Overcurrent is active</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
