StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986BE8.svd
            </registers>
        </peripheral>
        <!--MDR_PORTB-->
        <peripheral derivedFrom="MDR_PORTA">
            <name>MDR_PORTB</name>
            <description>PORTB</description>
            <baseAddress>0x40081000</baseAddress>
            <!--IRQ_PORTB-->
            <interrupt>
                <name>IRQ_PORTB</name>
                <value>84</value>
            </interrupt>
        </peripheral>
        <!--MDR_PORTC-->
        <peripheral derivedFrom="MDR_PORTA">
            <name>MDR_PORTC</name>
            <description>PORTC</description>
            <baseAddress>0x40082000</baseAddress>
            <!--IRQ_PORTC-->
            <interrupt>
                <name>IRQ_PORTC</name>
                <value>85</value>
            </interrupt>
        </peripheral>
        <!--MDR_PORTD-->
        <peripheral derivedFrom="MDR_PORTA">
            <name>MDR_PORTD</name>
            <description>PORTD</description>
            <baseAddress>0x40083000</baseAddress>
            <!--IRQ_PORTD-->
            <interrupt>
                <name>IRQ_PORTD</name>
                <value>86</value>
            </interrupt>
        </peripheral>
        <!--MDR_PORTE-->
        <peripheral derivedFrom="MDR_PORTA">
            <name>MDR_PORTE</name>
            <description>PORTE</description>
            <baseAddress>0x40084000</baseAddress>
                        <!--IRQ_PORTE-->
            <interrupt>
                <name>IRQ_PORTE</name>
                <value>87</value>
            </interrupt>
        </peripheral>
    </peripherals>
</device>
